app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "updated_at", "name") VALUES (?, ?, ?) RETURNING "id"  [["created_at", "2024-10-20 08:56:37.539057"], ["updated_at", "2024-10-20 08:56:37.539057"], ["name", "pavii"]]
SELECT "articles".* FROM "articles"
---
  def create
    @article = Article.new(article_params)

    if @article.save
      redirect_to articles_path
    else
     @articles = Article.all